madmoney99/OH-Sketches/boards.txt
apuleonardo.bootloader.tool=avrdude
apuleonardo.bootloader.tool.default=avrdude
apuleonardo.bootloader.low_fuses=0xff
apuleonardo.bootloader.high_fuses=0xd8
apuleonardo.bootloader.extended_fuses=0xcb
apuleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
apuleonardo.bootloader.unlock_bits=0x3F
apuleonardo.bootloader.lock_bits=0x2F

apuleonardo.build.mcu=atmega32u4
apuleonardo.build.f_cpu=16000000L
apuleonardo.build.vid=0x2341
apuleonardo.build.pid=0x8037
apuleonardo.build.usb_product="APU PANEL"
apuleonardo.build.board=AVR_LEONARDO
apuleonardo.build.core=arduino
apuleonardo.build.variant=leonardo
apuleonardo.build.extra_flags={build.usb_flags}

##############################################################

fuelleonardo.name=FUEL PANEL
fuelleonardo.vid.0=0x2341
fuelleonardo.pid.0=0x0036
fuelleonardo.vid.1=0x2341
fuelleonardo.pid.1=0x8036
fuelleonardo.vid.2=0x2A03
fuelleonardo.pid.2=0x0036
fuelleonardo.vid.3=0x2A03
fuelleonardo.pid.3=0x8036
fuelleonardo.upload_port.0.vid=0x2341
fuelleonardo.upload_port.0.pid=0x0036
fuelleonardo.upload_port.1.vid=0x2341
fuelleonardo.upload_port.1.pid=0x8036
fuelleonardo.upload_port.2.vid=0x2A03
fuelleonardo.upload_port.2.pid=0x0036
fuelleonardo.upload_port.3.vid=0x2A03
fuelleonardo.upload_port.3.pid=0x8036
fuelleonardo.upload_port.4.board=leonardo

fuelleonardo.upload.tool=avrdude
fuelleonardo.upload.tool.default=avrdude
fuelleonardo.upload.tool.network=arduino_ota
fuelleonardo.upload.protocol=avr109
fuelleonardo.upload.maximum_size=28672
fuelleonardo.upload.maximum_data_size=2560
fuelleonardo.upload.speed=57600
fuelleonardo.upload.disable_flushing=true
fuelleonardo.upload.use_1200bps_touch=true
fuelleonardo.upload.wait_for_upload_port=true

fuelleonardo.bootloader.tool=avrdude
fuelleonardo.bootloader.tool.default=avrdude
fuelleonardo.bootloader.low_fuses=0xff
fuelleonardo.bootloader.high_fuses=0xd8
fuelleonardo.bootloader.extended_fuses=0xcb
fuelleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
fuelleonardo.bootloader.unlock_bits=0x3F
fuelleonardo.bootloader.lock_bits=0x2F

fuelleonardo.build.mcu=atmega32u4
fuelleonardo.build.f_cpu=16000000L
fuelleonardo.build.vid=0x2341
fuelleonardo.build.pid=0x8038
fuelleonardo.build.usb_product="FUEL PANEL"
fuelleonardo.build.board=AVR_LEONARDO
fuelleonardo.build.core=arduino
fuelleonardo.build.variant=leonardo
fuelleonardo.build.extra_flags={build.usb_flags}

##############################################################

snsrleonardo.name=SNSR PANEL
snsrleonardo.vid.0=0x2341
snsrleonardo.pid.0=0x0036
snsrleonardo.vid.1=0x2341
snsrleonardo.pid.1=0x8036
snsrleonardo.vid.2=0x2A03
snsrleonardo.pid.2=0x0036
snsrleonardo.vid.3=0x2A03
snsrleonardo.pid.3=0x8036
snsrleonardo.upload_port.0.vid=0x2341
snsrleonardo.upload_port.0.pid=0x0036
snsrleonardo.upload_port.1.vid=0x2341
snsrleonardo.upload_port.1.pid=0x8036
snsrleonardo.upload_port.2.vid=0x2A03
snsrleonardo.upload_port.2.pid=0x0036
snsrleonardo.upload_port.3.vid=0x2A03
snsrleonardo.upload_port.3.pid=0x8036
snsrleonardo.upload_port.4.board=leonardo

snsrleonardo.upload.tool=avrdude
snsrleonardo.upload.tool.default=avrdude
snsrleonardo.upload.tool.network=arduino_ota
snsrleonardo.upload.protocol=avr109
snsrleonardo.upload.maximum_size=28672
snsrleonardo.upload.maximum_data_size=2560
snsrleonardo.upload.speed=57600
snsrleonardo.upload.disable_flushing=true
snsrleonardo.upload.use_1200bps_touch=true
snsrleonardo.upload.wait_for_upload_port=true

snsrleonardo.bootloader.tool=avrdude
snsrleonardo.bootloader.tool.default=avrdude
snsrleonardo.bootloader.low_fuses=0xff
snsrleonardo.bootloader.high_fuses=0xd8
snsrleonardo.bootloader.extended_fuses=0xcb
snsrleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
snsrleonardo.bootloader.unlock_bits=0x3F
snsrleonardo.bootloader.lock_bits=0x2F

snsrleonardo.build.mcu=atmega32u4
snsrleonardo.build.f_cpu=16000000L
snsrleonardo.build.vid=0x2341
snsrleonardo.build.pid=0x8039
snsrleonardo.build.usb_product="SNSR PANEL"
snsrleonardo.build.board=AVR_LEONARDO
snsrleonardo.build.core=arduino
snsrleonardo.build.variant=leonardo
snsrleonardo.build.extra_flags={build.usb_flags}

##############################################################

leonardoeth.name=Arduino Leonardo ETH
leonardoeth.vid.0=0x2a03
leonardoeth.pid.0=0x0040
leonardoeth.vid.1=0x2a03
leonardoeth.pid.1=0x8040
leonardoeth.upload_port.0.vid=0x2a03
leonardoeth.upload_port.0.pid=0x0040
leonardoeth.upload_port.1.vid=0x2a03
leonardoeth.upload_port.1.pid=0x8040
leonardoeth.upload_port.2.board=leonardoeth

leonardoeth.upload.tool=avrdude
leonardoeth.upload.tool.default=avrdude
leonardoeth.upload.tool.network=arduino_ota
leonardoeth.upload.protocol=avr109
leonardoeth.upload.maximum_size=28672
leonardoeth.upload.maximum_data_size=2560
leonardoeth.upload.speed=57600
leonardoeth.upload.disable_flushing=true
leonardoeth.upload.use_1200bps_touch=true
leonardoeth.upload.wait_for_upload_port=true

leonardoeth.bootloader.tool=avrdude
leonardoeth.bootloader.tool.default=avrdude
leonardoeth.bootloader.low_fuses=0xff
leonardoeth.bootloader.high_fuses=0xd8
leonardoeth.bootloader.extended_fuses=0xcb
leonardoeth.bootloader.file=caterina/Caterina-LeonardoEthernet.hex
leonardoeth.bootloader.unlock_bits=0x3F
leonardoeth.bootloader.lock_bits=0x2F

leonardoeth.build.mcu=atmega32u4
leonardoeth.build.f_cpu=16000000L
leonardoeth.build.vid=0x2a03
leonardoeth.build.pid=0x8040
leonardoeth.build.usb_product="Arduino Leonardo ETH"
leonardoeth.build.board=AVR_LEONARDO_ETH
leonardoeth.build.core=arduino
leonardoeth.build.variant=leonardo
leonardoeth.build.extra_flags={build.usb_flags}

##############################################################

micro.name=Arduino Micro

micro.vid.0=0x2341
micro.pid.0=0x0037
micro.vid.1=0x2341
micro.pid.1=0x8037
micro.vid.2=0x2A03
micro.pid.2=0x0037
micro.vid.3=0x2A03
micro.pid.3=0x8037
micro.vid.4=0x2341
micro.pid.4=0x0237
micro.vid.5=0x2341
micro.pid.5=0x8237
micro.upload_port.0.vid=0x2341
micro.upload_port.0.pid=0x0037
micro.upload_port.1.vid=0x2341
micro.upload_port.1.pid=0x8037
micro.upload_port.2.vid=0x2A03
micro.upload_port.2.pid=0x0037
micro.upload_port.3.vid=0x2A03
micro.upload_port.3.pid=0x8037
micro.upload_port.4.vid=0x2341
micro.upload_port.4.pid=0x0237
micro.upload_port.5.vid=0x2341
micro.upload_port.5.pid=0x8237
micro.upload_port.6.board=micro

micro.upload.tool=avrdude
micro.upload.tool.default=avrdude
micro.upload.tool.network=arduino_ota
micro.upload.protocol=avr109
micro.upload.maximum_size=28672
micro.upload.maximum_data_size=2560
micro.upload.speed=57600
micro.upload.disable_flushing=true
micro.upload.use_1200bps_touch=true
micro.upload.wait_for_upload_port=true

micro.bootloader.tool=avrdude
micro.bootloader.tool.default=avrdude
micro.bootloader.low_fuses=0xff
micro.bootloader.high_fuses=0xd8
micro.bootloader.extended_fuses=0xcb
micro.bootloader.file=caterina/Caterina-Micro.hex
micro.bootloader.unlock_bits=0x3F
micro.bootloader.lock_bits=0x2F

micro.build.mcu=atmega32u4
micro.build.f_cpu=16000000L
micro.build.vid=0x2341
micro.build.pid=0x8037
micro.build.usb_product="Arduino Micro"
micro.build.board=AVR_MICRO
micro.build.core=arduino
micro.build.variant=micro
micro.build.extra_flags={build.usb_flags}

